public_html/strava.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-03-20 vie 13:37 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>strava</title>
<meta name="author" content="Sherlockes" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' type='text/css' href='https://gongzhitaao.org/orgcss/org.css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">strava</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc99df53">1. Bibliotecas y módulos necesarios</a></li>
<li><a href="#orgda8a255">2. Credenciales</a></li>
<li><a href="#org2fa8061">3. Script en python</a></li>
</ul>
</div>
</div>
<p>
Lo que pretende una creación de un propio "heatmap" a partir de mis actividades de Strava usando <a href="python.html#ID-06032c9e-2664-4b4d-9bd3-ed72e16768a1">python</a>. Veremos hasta donde llegamos y por donde pasamos&#x2026;
</p>
<!--more-->


<p>
Tenemos creado un entorno virtual en la carpeta "/home/sherlockes/Temp/strava" según está descrito en el nodo de <a href="python.html#ID-06032c9e-2664-4b4d-9bd3-ed72e16768a1">python</a>.
</p>


<div id="outline-container-orgc99df53" class="outline-2">
<h2 id="orgc99df53"><span class="section-number-2">1.</span> Bibliotecas y módulos necesarios</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="https://stravalib.readthedocs.io/en/latest/">Stravalib</a> proporciona una interfaz fácil de usar para interactuar con la API de Strava, una plataforma popular para el seguimiento y análisis de actividades deportivas. Con Stravalib, los desarrolladores pueden acceder a datos de actividades, segmentos, atletas y más para crear aplicaciones relacionadas con el fitness.</li>
<li><a href="https://pypi.org/project/python-dotenv/">python-dotenv</a> facilita la gestión de variables de entorno en proyectos. Permite cargar variables desde archivos .env en el entorno de desarrollo, lo que simplifica la configuración y la portabilidad del código. Es útil para almacenar credenciales y configuraciones sensibles de manera segura y modular.</li>
<li><a href="https://flask.palletsprojects.com">Flask</a> es un framework web minimalista que facilita la creación de aplicaciones web rápidas y escalables. Con una sintaxis simple y flexible, Flask ofrece extensiones para funcionalidades adicionales, como autenticación, bases de datos y API RESTful. Es popular por su facilidad de uso y su comunidad activa.</li>
<li><a href="https://pypi.org/project/requests/">requests</a> es utilizada para realizar solicitudes HTTP de manera sencilla y elegante. Ofrece una interfaz amigable para enviar solicitudes GET, POST, PUT, DELETE y más. Con Requests, los desarrolladores pueden interactuar con APIs web y realizar tareas como la descarga de contenido o el envío de datos fácilmente.</li>
<li><a href="https://docs.python.org/3/library/webbrowser.html">webbrowser</a> es un módulo de Python que proporciona una interfaz para abrir y controlar navegadores web desde programas Python. Permite abrir una URL en el navegador predeterminado del sistema, así como también proporciona funciones para abrir nuevas pestañas, nuevas ventanas y controlar la navegación web de manera programática. Es útil para automatizar tareas de navegación web y lanzar aplicaciones web desde scripts.</li>
<li><a href="https://docs.python.org/3/library/datetime.html">datetime</a> es un módulo en Python que proporciona clases para manejar fechas y horas de manera eficiente. Permite crear objetos de fecha y hora, realizar cálculos y operaciones con ellos, formatear y analizar fechas y horas, y trabajar con zonas horarias. Es fundamental para trabajar con datos temporales en aplicaciones Python, como la gestión de eventos, programación, análisis de series temporales y más.</li>
<li><a href="https://docs.python.org/3/library/os.html">os</a> proporciona funciones para interactuar con el sistema operativo subyacente. Permite realizar operaciones como navegación de directorios, manipulación de archivos, gestión de procesos, acceso a variables de entorno y más. Es esencial para tareas relacionadas con el sistema de archivos y la administración de recursos en programas Python.</li>
<li><a href="https://docs.python.org/3/library/logging.html">logging</a> facilita la implementación de registro de eventos en aplicaciones. Permite registrar mensajes de diferentes niveles de gravedad, como DEBUG, INFO, WARNING, ERROR y CRITICAL, en varios destinos, como la consola, archivos, o incluso a través de red. Esto ayuda en la depuración, monitoreo y seguimiento de errores en el código de manera estructurada y configurable.</li>
</ul>
</div>
</div>

<div id="outline-container-orgda8a255" class="outline-2">
<h2 id="orgda8a255"><span class="section-number-2">2.</span> Credenciales</h2>
<div class="outline-text-2" id="text-2">
<p>
Necesitamos las credenciales "client<sub>id</sub>" y "client<sub>secret</sub>" para el acceso a la API de Strava que almacenaremos en la carpeta donde vamos a guardar los datos. Meteremos estas credenciales en un archivo ".env" con la siguiente forma:
</p>

<div class="org-src-container">
<pre class="src src-txt">CLIENT_ID=*******
CLIENT_SECRET=*************************
</pre>
</div>

<p>
Para cargar estas credenciales como variables a la hora de usar el script emplearemos la librería <a href="https://pypi.org/project/python-dotenv/">python-dotenv</a> con las siguientes líneas:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #cae682;">ruta_strava</span> = <span style="color: #95e454;">'/home/sherlockes/strava/'</span>
<span style="color: #cae682;">ruta_archivo_env</span> = ruta_strava + <span style="color: #95e454;">'.env'</span>
load_dotenv(ruta_archivo_env)
<span style="color: #cae682;">client_id</span> = os.getenv(<span style="color: #95e454;">'CLIENT_ID'</span>)
<span style="color: #cae682;">client_secret</span> = os.getenv(<span style="color: #95e454;">'CLIENT_SECRET'</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-org2fa8061" class="outline-2">
<h2 id="org2fa8061"><span class="section-number-2">3.</span> Script en python</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #8ac6f2; font-weight: bold;">from</span> stravalib.client <span style="color: #8ac6f2; font-weight: bold;">import</span> Client

<span style="color: #cae682;">client</span> = Client()
<span style="color: #cae682;">authorize_url</span> = client.authorization_url(
    client_id=114649, redirect_uri=<span style="color: #95e454;">"http://localhost:8282/authorized"</span>
)
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-10-31</p>
<p class="author">Author: Sherlockes</p>
<p class="date">Created: 2026-03-20 vie 13:37</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
